# Pandas( Series and DataFrame )

## 1) Pandas Series

In [106]:
import pandas as pd

In [107]:
pd.Series([1,2,3,4,True,False])

0        1
1        2
2        3
3        4
4     True
5    False
dtype: object

In [108]:
a=pd.Series([1,2,3,4,True,False],dtype='int32',index=['a','b','c','d','e','f'])
print(a)

a    1
b    2
c    3
d    4
e    1
f    0
dtype: int32

In [109]:
print(a['b'])

2

In [110]:
b=pd.Series([1,2,3,4.5])
print(b)

0    1.0
1    2.0
2    3.0
3    4.5
dtype: float64

## Dictionary Series

In [111]:
d={"name":"sachin","roll":12,"age":25}
pd.Series(d)

name    sachin
roll        12
age         25
dtype: object

### Single element multiple index

In [112]:
e=pd.Series(1,index=[1,2,3,4,5,6])
print(e)

1    1
2    1
3    1
4    1
5    1
6    1
dtype: int64

## 2) Pandas Dataframe

In [113]:
name=pd.Series(["Dev","Indra","Bakhati"])
salary=pd.Series([1000,2000,3000])

In [118]:
df=pd.DataFrame({"Name":name,"Salary":salary})
print(df)

      Name  Salary
0      Dev    1000
1    Indra    2000
2  Bakhati    3000

In [119]:
df.shape

(3, 2)

In [120]:
df.size

6

In [121]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [125]:
df["Name"]

0        Dev
1      Indra
2    Bakhati
Name: Name, dtype: object

In [134]:
df[["Name"]]

      Name
0      Dev
1    Indra
2  Bakhati

In [132]:
df["Salary"]

0    1000
1    2000
2    3000
Name: Salary, dtype: int64

In [130]:
df[["Salary"]]

   Salary
0    1000
1    2000
2    3000

In [135]:
df[["Name","Salary"]]

      Name  Salary
0      Dev    1000
1    Indra    2000
2  Bakhati    3000

In [136]:
df2=df[["Name"]].copy()

In [137]:
print(df2)

      Name
0      Dev
1    Indra
2  Bakhati

### Slicing

In [140]:
df[1:3]

      Name  Salary
1    Indra    2000
2  Bakhati    3000